/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   argck.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: nateshim <nateshim@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/09/14 19:08:25 by nateshim          #+#    #+#             */
/*   Updated: 2024/09/14 20:04:12 by nateshim         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//異常を確認
//コマンドライン引数の入力の妥当性を確認
void	ft_print(char *c);

int	argck(char *str)
{
	int i;

	i = -1;
	while (++i < 31) // 31回ループする (入力する数字と空白を含めた数)
	{
		if (i % 2 == 0) //偶数の時数字を入れる
		{
			if (!(str[i] >= '1' && str[i] <= '4')) // 1~4の間に数字が入っているか
			{
				return (0);
			}
		}
		else // 奇数の時空白を入れたい
		{
			if (str[i] != ' ')
			{
				return (0); ///異常な入力として判断
			}
		}
	}
	if (str[i] != '\0')
	{
		return (0); //余分な字が入っていた時は異常として返す
	}
	return (1); //正常な入力として返す
}