/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strtok.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: nateshim <nateshim@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/09/14 17:58:00 by nateshim          #+#    #+#             */
/*   Updated: 2024/09/14 19:52:52 by nateshim         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdlib.h>
void  ft_strtok(char *str, int (*number)[4])
{
	int i;// 入力した文字列の中で何番めかを表している
	int j;//1,2,3,4の振り分け
	int k;//up, down, left, right

	i = 0;
	j = 0;
	k = 0;
	while (k < 4)
	{
		j = 0;
		while (j < 4)
		{
			if (str[i] != ' ')
			{
				number [k] [j] = str[i] - '0';
				j++;
			}
			i++;
		}
		k++;
	}
}